In [7]:
import pandas as pd

In [8]:
df = pd.read_excel("../../data/course_participants.xlsx")
df

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## Index

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
# change index name
df.index.name = "idx"
df

     user_id   name  age  country  score continent
idx
0       1001   Mark   55    Italy    4.5    Europe
1       1000   John   33      USA    6.7   America
2       1002    Tim   41      USA    3.9   America
3       1003  Jenny   12  Germany    9.0    Europe

In [11]:
df.reset_index().set_index("name").sort_index()

       idx  user_id  age  country  score continent
name
Jenny    3     1003   12  Germany    9.0    Europe
John     1     1000   33      USA    6.7   America
Mark     0     1001   55    Italy    4.5    Europe
Tim      2     1002   41      USA    3.9   America

In [12]:
# use sort_values to sort the rows by one or more columns
df.sort_values(["continent", "age"])

     user_id   name  age  country  score continent
idx
1       1000   John   33      USA    6.7   America
2       1002    Tim   41      USA    3.9   America
3       1003  Jenny   12  Germany    9.0    Europe
0       1001   Mark   55    Italy    4.5    Europe

## Columns

In [13]:
# get info of columns
df.columns

Index(['user_id', 'name', 'age', 'country', 'score', 'continent'], dtype='object')

In [14]:
# rename column names
df.rename(columns={"name": "First Name", "age": "Age"})

     user_id First Name  Age  country  score continent
idx
0       1001       Mark   55    Italy    4.5    Europe
1       1000       John   33      USA    6.7   America
2       1002        Tim   41      USA    3.9   America
3       1003      Jenny   12  Germany    9.0    Europe

In [15]:
# drop columns
df.drop(columns=["name", "country"],
        index=[1, 3])

     user_id  age  score continent
idx
0       1001   55    4.5    Europe
2       1002   41    3.9   America

In [16]:
# Shortcut for df.transpose()
df.T

idx             0        1        2        3
user_id      1001     1000     1002     1003
name         Mark     John      Tim    Jenny
age            55       33       41       12
country     Italy      USA      USA  Germany
score         4.5      6.7      3.9      9.0
continent  Europe  America  America   Europe

In [17]:
# select by column names
df.loc[:, ["continent", "country", "name"]]

    continent  country   name
idx
0      Europe    Italy   Mark
1     America      USA   John
2     America      USA    Tim
3      Europe  Germany  Jenny

## Duplicate Data

In [18]:
df.drop_duplicates(["country", "continent"])

     user_id   name  age  country  score continent
idx
0       1001   Mark   55    Italy    4.5    Europe
1       1000   John   33      USA    6.7   America
3       1003  Jenny   12  Germany    9.0    Europe

In [19]:
# find out if a certain column contains duplicates
df["country"].is_unique

False

In [21]:
# get a certain column's unique values
df["country"].unique()

array(['Italy', 'USA', 'Germany'], dtype=object)